//Напишите программу, которая принимает на вход трёхзначное целое число и на выходе показывает 
//сумму первой и последней цифры этого числа. 456  =>  10 782  =>  9 918  =>  17
int num = System.Console.Read();
System.Console.WriteLine(num);